In [3]:
import numpy as np
import pandas as pd

In [4]:
pd.read_csv('Line.csv')

  First Name Last Name  Position in Line
0        Bob    Henson                 2
1        Joe     Chang                 1
2       Will     Small                 4
3       Lily     Smith                 5
4     Andrew     Jones                 3

In [5]:
pd.read_excel('Line.xlsx')

  First Name Last Name  Position in Line
0        Bob    Henson                 2
1        Joe     Chang                 1
2       Will     Small                 4
3       Lily     Smith                 5
4     Andrew     Jones                 3

In [6]:
data = pd.read_csv('Line.csv')

In [7]:
data['ID'] = range(0,5)

In [8]:
data

  First Name Last Name  Position in Line  ID
0        Bob    Henson                 2   0
1        Joe     Chang                 1   1
2       Will     Small                 4   2
3       Lily     Smith                 5   3
4     Andrew     Jones                 3   4

In [9]:
data = data.append(pd.DataFrame({"First Name":["Blake"],"Last Name":["Hill"],"Position in Line":[6],"ID":[6]}))
data

  First Name Last Name  Position in Line  ID
0        Bob    Henson                 2   0
1        Joe     Chang                 1   1
2       Will     Small                 4   2
3       Lily     Smith                 5   3
4     Andrew     Jones                 3   4
0      Blake      Hill                 6   6

In [10]:
data.columns

Index(['First Name', 'Last Name', 'Position in Line', 'ID'], dtype='object')

In [11]:
data.iloc[1]

First Name            Joe
Last Name           Chang
Position in Line        1
ID                      1
Name: 1, dtype: object

In [12]:
data.to_csv('LineModified.csv')
data.to_excel('LineModified.xlsx')